[
  {
    "id": "argentinosaurus",
    "species": "Argentinosaurus",
    "nickname": "The Titan",
    "type": "herbivore",
    "era": "Late Cretaceous",
    "diet": "Herbivore",
    "height": "21.0m",
    "length": "35.0m",
    "weight": "73,000 kg",
    "speed": "8 km/h",
    "dangerLevel": 2,
    "intelligence": 2,
    "aggressiveness": 0,
    "imageKey": "argentinosaurus",
    "description": "One of the largest land animals to ever walk the Earth. Argentinosaurus is a titanosaur sauropod whose sheer size is its ultimate defense. A single adult can weigh as much as 10 African elephants, making it virtually immune to predation.",
    "funFact": "Argentinosaurus eggs were only about the size of a rugby ball — meaning a hatchling grew over 25,000 times its birth weight to reach full adult size. It consumed roughly 500 kg of vegetation daily.",
    "habitat": "Open floodplains and tall conifer forests",
    "status": "CONTAINED",
    "coordinates": [700, 350],
    "price": 149
  },
  {
    "id": "triceratops",
    "species": "Triceratops",
    "nickname": "The Shield Bearer",
    "type": "herbivore",
    "era": "Late Cretaceous",
    "diet": "Herbivore",
    "height": "3.0m",
    "length": "9.0m",
    "weight": "6,100 kg",
    "speed": "32 km/h",
    "dangerLevel": 2,
    "intelligence": 2,
    "aggressiveness": 1,
    "imageKey": "triceratops",
    "description": "One of the most recognizable dinosaurs, the Triceratops is a heavy herbivore armed with three formidable horns and a massive bony frill. Despite its peaceful nature, it can charge at speeds up to 32 km/h when threatened — enough to flip a car.",
    "funFact": "A Triceratops frill contained a network of blood vessels that could flush with color — essentially allowing it to 'blush' when excited or threatened. Fossil evidence shows battle scars on frills, suggesting they jousted like modern deer.",
    "habitat": "Open grasslands and gentle valleys",
    "status": "CONTAINED",
    "coordinates": [550, 550],
    "price": 129
  },
  {
    "id": "tyrannosaurus",
    "species": "Tyrannosaurus Rex",
    "nickname": "The King",
    "type": "carnivore",
    "era": "Late Cretaceous",
    "diet": "Carnivore",
    "height": "5.6m",
    "length": "12.3m",
    "weight": "8,400 kg",
    "speed": "32 km/h",
    "dangerLevel": 5,
    "intelligence": 3,
    "aggressiveness": 5,
    "imageKey": "tyrannosaurus",
    "description": "The undisputed king of the dinosaurs. Tyrannosaurus Rex possesses the most powerful bite force of any terrestrial animal ever recorded — estimated at over 12,800 pounds. Its massive skull, reaching 1.5 meters in length, houses teeth the size of bananas.",
    "funFact": "T-Rex had binocular vision better than a hawk's, allowing it to see in 3D and spot prey from over a mile away. Its tiny arms could still bench-press around 200 kg each — far from useless.",
    "habitat": "Dense forest edges and open plains",
    "status": "CONTAINED",
    "coordinates": [600, 420],
    "price": 299
  },
  {
    "id": "spinosaurus",
    "species": "Spinosaurus",
    "nickname": "The River Devil",
    "type": "carnivore",
    "era": "Late Cretaceous",
    "diet": "Carnivore",
    "height": "5.0m",
    "length": "15.0m",
    "weight": "7,500 kg",
    "speed": "24 km/h",
    "dangerLevel": 5,
    "intelligence": 3,
    "aggressiveness": 4,
    "imageKey": "spinosaurus",
    "description": "The largest carnivorous dinosaur ever discovered — even bigger than T-Rex. Spinosaurus is a semi-aquatic predator with a massive sail on its back that can reach 1.8 meters tall. It hunted both on land and in water, making it one of the most versatile apex predators.",
    "funFact": "Spinosaurus is the only known dinosaur adapted to swimming. Its dense bones acted like ballast, and its paddle-like tail propelled it through water like a crocodile. It primarily ate giant fish, including sharks.",
    "habitat": "River deltas, mangrove swamps, and tidal zones",
    "status": "CONTAINED",
    "coordinates": [450, 300],
    "price": 279
  },
  {
    "id": "plesiosaurus",
    "species": "Plesiosaurus",
    "nickname": "The Nessie",
    "type": "aquatic",
    "era": "Early Jurassic",
    "diet": "Piscivore",
    "height": "2.0m",
    "length": "5.0m",
    "weight": "500 kg",
    "speed": "15 km/h",
    "dangerLevel": 2,
    "intelligence": 2,
    "aggressiveness": 2,
    "imageKey": "plesiosaurus",
    "description": "The legendary long-necked marine reptile that inspired the Loch Ness Monster myth. Plesiosaurus uses four powerful flippers to 'fly' gracefully through water. Its incredibly long neck allows it to ambush schools of fish from below — like a living fishing rod.",
    "funFact": "Plesiosaurus swallowed smooth stones (called gastroliths) to help grind food in its stomach and to control buoyancy — essentially using rocks as diving weights. Some fossils were found with over 200 stones inside.",
    "habitat": "Shallow warm seas and coastal lagoons",
    "status": "CONTAINED",
    "coordinates": [350, 450],
    "price": 169
  },
  {
    "id": "mosasaurus",
    "species": "Mosasaurus",
    "nickname": "The Ocean Titan",
    "type": "aquatic",
    "era": "Late Cretaceous",
    "diet": "Carnivore",
    "height": "4.5m",
    "length": "17.0m",
    "weight": "15,000 kg",
    "speed": "48 km/h",
    "dangerLevel": 5,
    "intelligence": 2,
    "aggressiveness": 5,
    "imageKey": "mosasaurus",
    "description": "The apex predator of the ancient seas. Mosasaurus dwarfs modern great white sharks and could take down almost anything in the ocean. Residing in our 3-million-gallon saltwater lagoon, this magnificent beast performs daily feeding shows that are the park's most popular attraction.",
    "funFact": "Mosasaurus could unhinge its jaw like a snake, allowing it to swallow prey nearly half its own size. It breathed air like a whale, surfacing every 20-30 minutes. Its closest living relatives are monitor lizards, not snakes.",
    "habitat": "Deep saltwater lagoon and open ocean",
    "status": "CONTAINED",
    "coordinates": [400, 600],
    "price": 199
  },
  {
    "id": "pteranodon",
    "species": "Pteranodon",
    "nickname": "The Sky Sentinel",
    "type": "flying",
    "era": "Late Cretaceous",
    "diet": "Piscivore",
    "height": "1.8m",
    "length": "1.2m",
    "weight": "25 kg",
    "speed": "80 km/h",
    "dangerLevel": 3,
    "intelligence": 2,
    "aggressiveness": 2,
    "imageKey": "pteranodon",
    "description": "A magnificent flying reptile with an iconic backward-pointing crest and a wingspan reaching 7 meters. Despite its size, Pteranodon weighed less than a large dog thanks to hollow bones. It soared over ancient seas, diving to catch fish like a modern pelican.",
    "funFact": "Pteranodon's crest likely served as a stabilizer during flight and as a display structure to attract mates. Males had significantly larger crests than females. It could glide for hundreds of miles without flapping its wings.",
    "habitat": "Coastal cliffs and enclosed aviary dome",
    "status": "CONTAINED",
    "coordinates": [500, 250],
    "price": 159
  },
  {
    "id": "pterosaur",
    "species": "Pterosaur",
    "nickname": "The Ancient Glider",
    "type": "flying",
    "era": "Late Triassic – Late Cretaceous",
    "diet": "Omnivore",
    "height": "1.5m",
    "length": "1.0m",
    "weight": "20 kg",
    "speed": "65 km/h",
    "dangerLevel": 2,
    "intelligence": 2,
    "aggressiveness": 2,
    "imageKey": "pterosaur",
    "description": "The first vertebrates ever to achieve powered flight — 80 million years before birds. Pterosaurs are an incredibly diverse order, ranging from sparrow-sized to giraffe-sized. Our specimens represent medium-sized species perfectly suited to our enclosed aviary.",
    "funFact": "Pterosaurs were covered in hair-like filaments called 'pycnofibers' — meaning they were fuzzy, not scaly. The largest pterosaur, Quetzalcoatlus, had a wingspan of 10 meters — the size of a small airplane.",
    "habitat": "Enclosed glass aviary dome",
    "status": "CONTAINED",
    "coordinates": [650, 550],
    "price": 139
  }
]
